In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

In [3]:
df_makers = pd.read_csv(r"C:\Users\vivek\Downloads\Electric_Vehicles_Project\Dataset\electric_vehicle_sales_by_makers.csv")
df_state = pd.read_csv(r"C:\Users\vivek\Downloads\Electric_Vehicles_Project\Dataset\electric_vehicle_sales_by_state.csv")
df_date = pd.read_csv(r"C:\Users\vivek\Downloads\Electric_Vehicles_Project\Dataset\dim_date.csv")

In [4]:
df_makers.head()

        date vehicle_category         maker  electric_vehicles_sold
0  01-Apr-21       2-Wheelers  OLA ELECTRIC                       0
1  01-Apr-22       2-Wheelers      OKAYA EV                       0
2  01-May-21       2-Wheelers  OLA ELECTRIC                       0
3  01-Jun-21       2-Wheelers  OLA ELECTRIC                       0
4  01-Jul-21       2-Wheelers  OLA ELECTRIC                       0

In [5]:
df_state.head()

,date,state,vehicle_category,electric_vehicles_sold,total_vehicles_sold
0,01-Apr-21,Sikkim,2-Wheelers,0,398
1,01-Apr-21,Sikkim,4-Wheelers,0,361
2,01-May-21,Sikkim,2-Wheelers,0,113
3,01-May-21,Sikkim,4-Wheelers,0,98
4,01-Jun-21,Sikkim,2-Wheelers,0,229

In [6]:
df_date.head()

        date  fiscal_year quarter
0  01-Apr-21         2022      Q1
1  01-May-21         2022      Q1
2  01-Jun-21         2022      Q1
3  01-Jul-21         2022      Q2
4  01-Aug-21         2022      Q2

In [7]:
df_makers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   date                    816 non-null    object
 1   vehicle_category        816 non-null    object
 2   maker                   816 non-null    object
 3   electric_vehicles_sold  816 non-null    int64
dtypes: int64(1), object(3)
memory usage: 25.6+ KB

In [8]:
df_state.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2445 entries, 0 to 2444
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   date                    2445 non-null   object
 1   state                   2445 non-null   object
 2   vehicle_category        2445 non-null   object
 3   electric_vehicles_sold  2445 non-null   int64
 4   total_vehicles_sold     2445 non-null   int64
dtypes: int64(2), object(3)
memory usage: 95.6+ KB

In [9]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         36 non-null     object
 1   fiscal_year  36 non-null     int64
 2   quarter      36 non-null     object
dtypes: int64(1), object(2)
memory usage: 992.0+ bytes

In [10]:
df_makers.describe().info

<bound method DataFrame.info of        electric_vehicles_sold
count              816.000000
mean              2531.998775
std               4771.077333
min                  0.000000
25%                 42.000000
50%                662.000000
75%               2636.500000
max              44630.000000>

In [11]:
df_state.describe().sum()

electric_vehicles_sold     32733.202918
total_vehicles_sold       488837.232442
dtype: float64

In [12]:
df_date.describe().sum()

fiscal_year    12174.828079
dtype: float64

In [13]:
df_makers.tail()

          date vehicle_category            maker  electric_vehicles_sold
811  01-Mar-24       2-Wheelers           BGAUSS                    3070
812  01-Mar-24       2-Wheelers  BATTRE ELECTRIC                     625
813  01-Mar-24       2-Wheelers    KINETIC GREEN                    3915
814  01-Mar-24       2-Wheelers           REVOLT                     585
815  01-Mar-24       2-Wheelers           OTHERS                   10579

In [14]:
df_state.tail()

,date,state,vehicle_category,electric_vehicles_sold,total_vehicles_sold
2440,01-Mar-24,Mizoram,2-Wheelers,58,1932
2441,01-Mar-24,DNH and DD,2-Wheelers,25,780
2442,01-Mar-24,Manipur,2-Wheelers,13,1394
2443,01-Mar-24,Andaman & Nicobar Island,2-Wheelers,2,447
2444,01-Mar-24,Nagaland,2-Wheelers,2,1180

In [15]:
df_date.tail()

         date  fiscal_year quarter
31  01-Nov-23         2024      Q3
32  01-Dec-23         2024      Q3
33  01-Jan-24         2024      Q4
34  01-Feb-24         2024      Q4
35  01-Mar-24         2024      Q4